#Задача 1 (Арифметические операции)
#Напиши код, который вычисляет остаток от деления числа 27 на 4 и сохраняет результат в переменную remainder.

remainder = 27 % 4

#Задача 2 (Именование переменных)
#Исправь некорректное имя переменной: 2nd_name = "Иван".

second_name = "Иван"

#Задача 3 (Типы данных)
#Определи тип данных значения 3.14 с помощью функции type() и сохрани результат в переменную data_type.

data_type = type(3.14)

#Задача 4 (Операции сравнения)
#Напиши выражение, которое проверяет, больше ли 100, чем 99.99, и выводит результат на экран.

print(100 > 99.99)

#Задача 5 (Объявление переменных)
#Объяви переменную is_valid, которая хранит логическое значение False.

is_valid = False

#Задача 6 (Преобразование типов данных)
#Преобразуй строку "123" в целое число и сохрани его в переменную number.

number = int("123")

#Задача 7 (Классификация по типам данных)
#Приведи пример значения для каждого из типов: int, float, str, bool.

4
4.2
"Питон"
True

#Задача 8 (Переопределение переменной)
#Измени значение переменной counter = 5 на 10, используя оператор присваивания.

counter = 5
counter = 10

#Задача 9 (Преобразование типов данных)
#Преобразуй число 456 в строку и сохрани результат в переменную str_num.

str_num = str(456)

#Задача 10 (Операции сравнения)
#Напиши выражение, которое проверяет, равно ли 100 делённое на 2 значению 50, и выводит результат на экран.

print(100/2==50)